def solution(letter):
    answer = ''
    letter_to_list = []
    
    morse = {'.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'}
    
    # 해시를 사용하자
    
    # 주어진 문자열을 공백을 기준으로 리스트로 변환
    letter_to_list = letter.split(' ')
    
    # 해시 특성을 이용하여 문자열로 변환
    for i in letter_to_list:
        answer += morse[i]
    
    return answer